CREATE DATABASE  IF NOT EXISTS `water2water` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `water2water`;
-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: water2water
-- ------------------------------------------------------
-- Server version	8.0.36

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `answer_board`
--

DROP TABLE IF EXISTS `answer_board`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `answer_board` (
  `seq` int NOT NULL AUTO_INCREMENT,
  `content` text NOT NULL,
  `created_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `member_id` int NOT NULL,
  `question_board_id` int NOT NULL,
  PRIMARY KEY (`seq`),
  KEY `answerboard_ibfk_1` (`question_board_id`),
  KEY `answer_member_fk_idx` (`member_id`),
  CONSTRAINT `answer_board_ibfk_1` FOREIGN KEY (`question_board_id`) REFERENCES `question_board` (`seq`) ON DELETE CASCADE,
  CONSTRAINT `answer_member_fk` FOREIGN KEY (`member_id`) REFERENCES `member` (`member_id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='after answer, questionboard''s is_answered is true';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `answer_board`
--

LOCK TABLES `answer_board` WRITE;
/*!40000 ALTER TABLE `answer_board` DISABLE KEYS */;
INSERT INTO `answer_board` VALUES (3,'답변입니다. 그 이유는 어쩌구 저쩌구','2024-07-06 06:41:12',2,3);
/*!40000 ALTER TABLE `answer_board` ENABLE KEYS */;
UNLOCK TABLES;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`project`@`%`*/ /*!50003 TRIGGER `answerboard_AFTER_INSERT` AFTER INSERT ON `answer_board` FOR EACH ROW BEGIN
	UPDATE `Question_Board`
    SET `is_answered` = 1
    WHERE `seq` = NEW.`question_board_id`;
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;

--
-- Table structure for table `member`
--

DROP TABLE IF EXISTS `member`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `member` (
  `member_id` int NOT NULL AUTO_INCREMENT,
  `email` varchar(45) NOT NULL,
  `password` varchar(255) NOT NULL,
  `username` varchar(45) NOT NULL,
  `role` enum('ROLE_USER','ROLE_ADMIN') NOT NULL DEFAULT 'ROLE_USER',
  PRIMARY KEY (`member_id`),
  UNIQUE KEY `email_UNIQUE` (`email`),
  UNIQUE KEY `username_UNIQUE` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `member`
--

LOCK TABLES `member` WRITE;
/*!40000 ALTER TABLE `member` DISABLE KEYS */;
INSERT INTO `member` VALUES (1,'test@gmail.com','$2a$10$ocn/rSRNdEVADdeLZPPKDe49MyUbBi2Puuus2XIG35kkqzD7zIoZG','test','ROLE_USER'),(2,'scott@gmail.com','$2a$10$Wixc0lRWbKv/7kmhrxmpuO/qT0BVOIyvfRdiyS7JaMqc0Sj9fhDEu','scott','ROLE_ADMIN'),(3,'baejimil@naver.com','$2a$10$G2msSuPkZ/JvgvZ2/6eaaOVUy.05iRWyKQp3DbXnS19kI1vWHiVNu','baegimil','ROLE_USER'),(4,'woojung@naver.com','$2a$10$snmCUeFS4cd9QK3Jrjf/EuF4ipUTpF.CCkwJXgyjkhOPHkHU0xgQq','woojung','ROLE_USER'),(5,'youngin@naver.com','$2a$10$ekjwoIV7VRGwzP3lDy6CkuxQerQBaHbkhHEUalsI46EJWtTRLRYsS','youngin','ROLE_USER');
/*!40000 ALTER TABLE `member` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `question_board`
--

DROP TABLE IF EXISTS `question_board`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `question_board` (
  `seq` int NOT NULL AUTO_INCREMENT,
  `title` varchar(100) NOT NULL,
  `content` text NOT NULL,
  `is_answered` tinyint NOT NULL DEFAULT '0',
  `created_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `member_id` int NOT NULL,
  `question_type` enum('STATION','ALERT','DUST','ETC') NOT NULL DEFAULT 'ETC',
  PRIMARY KEY (`seq`),
  KEY `question_member_fk_idx` (`member_id`),
  CONSTRAINT `question_member_fk` FOREIGN KEY (`member_id`) REFERENCES `member` (`member_id`)
) ENGINE=InnoDB AUTO_INCREMENT=103 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `question_board`
--

LOCK TABLES `question_board` WRITE;
/*!40000 ALTER TABLE `question_board` DISABLE KEYS */;
INSERT INTO `question_board` VALUES (1,'문의사항있습니다1','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'DUST'),(2,'문의사항있습니다2','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'STATION'),(3,'문의사항있습니다3','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',1,'2024-07-06 06:41:12',4,'STATION'),(4,'문의사항있습니다4','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'STATION'),(5,'문의사항있습니다5','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'DUST'),(6,'문의사항있습니다6','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'STATION'),(7,'문의사항있습니다7','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'DUST'),(8,'문의사항있습니다8','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'ALERT'),(9,'문의사항있습니다9','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'ALERT'),(10,'문의사항있습니다10','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'STATION'),(11,'문의사항있습니다11','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'DUST'),(12,'문의사항있습니다12','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'DUST'),(13,'문의사항있습니다13','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'ETC'),(14,'문의사항있습니다14','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'STATION'),(15,'문의사항있습니다15','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ETC'),(16,'문의사항있습니다16','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'STATION'),(17,'문의사항있습니다17','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'DUST'),(18,'문의사항있습니다18','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'ETC'),(19,'문의사항있습니다19','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'DUST'),(20,'문의사항있습니다20','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ETC'),(21,'문의사항있습니다21','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'STATION'),(22,'문의사항있습니다22','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'ETC'),(23,'문의사항있습니다23','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'STATION'),(24,'문의사항있습니다24','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'DUST'),(25,'문의사항있습니다25','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'DUST'),(26,'문의사항있습니다26','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'STATION'),(27,'문의사항있습니다27','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'DUST'),(28,'문의사항있습니다28','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'STATION'),(29,'문의사항있습니다29','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'ETC'),(30,'문의사항있습니다30','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ALERT'),(31,'문의사항있습니다31','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'ALERT'),(32,'문의사항있습니다32','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'ALERT'),(33,'문의사항있습니다33','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'ALERT'),(34,'문의사항있습니다34','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'ALERT'),(35,'문의사항있습니다35','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ALERT'),(36,'문의사항있습니다36','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'DUST'),(37,'문의사항있습니다37','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'ETC'),(38,'문의사항있습니다38','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'ALERT'),(39,'문의사항있습니다39','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'DUST'),(40,'문의사항있습니다40','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ETC'),(41,'문의사항있습니다41','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'DUST'),(42,'문의사항있습니다42','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'DUST'),(43,'문의사항있습니다43','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'DUST'),(44,'문의사항있습니다44','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'STATION'),(45,'문의사항있습니다45','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ETC'),(46,'문의사항있습니다46','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'STATION'),(47,'문의사항있습니다47','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'STATION'),(48,'문의사항있습니다48','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'DUST'),(49,'문의사항있습니다49','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'STATION'),(50,'문의사항있습니다50','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ETC'),(51,'문의사항있습니다51','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'STATION'),(52,'문의사항있습니다52','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'ETC'),(53,'문의사항있습니다53','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'STATION'),(54,'문의사항있습니다54','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'STATION'),(55,'문의사항있습니다55','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ETC'),(56,'문의사항있습니다56','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'DUST'),(57,'문의사항있습니다57','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'ALERT'),(58,'문의사항있습니다58','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'ETC'),(59,'문의사항있습니다59','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'ETC'),(60,'문의사항있습니다60','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'STATION'),(61,'문의사항있습니다61','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'DUST'),(62,'문의사항있습니다62','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'DUST'),(63,'문의사항있습니다63','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'ALERT'),(64,'문의사항있습니다64','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'STATION'),(65,'문의사항있습니다65','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ETC'),(66,'문의사항있습니다66','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'ETC'),(67,'문의사항있습니다67','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'STATION'),(68,'문의사항있습니다68','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'DUST'),(69,'문의사항있습니다69','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'ETC'),(70,'문의사항있습니다70','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ETC'),(71,'문의사항있습니다71','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'DUST'),(72,'문의사항있습니다72','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'DUST'),(73,'문의사항있습니다73','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'ETC'),(74,'문의사항있습니다74','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'ETC'),(75,'문의사항있습니다75','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ETC'),(76,'문의사항있습니다76','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'ALERT'),(77,'문의사항있습니다77','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'DUST'),(78,'문의사항있습니다78','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'ETC'),(79,'문의사항있습니다79','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'ETC'),(80,'문의사항있습니다80','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ETC'),(81,'문의사항있습니다81','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'ALERT'),(82,'문의사항있습니다82','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'STATION'),(83,'문의사항있습니다83','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'STATION'),(84,'문의사항있습니다84','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'ALERT'),(85,'문의사항있습니다85','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'STATION'),(86,'문의사항있습니다86','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'DUST'),(87,'문의사항있습니다87','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'STATION'),(88,'문의사항있습니다88','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'STATION'),(89,'문의사항있습니다89','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'DUST'),(90,'문의사항있습니다90','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ETC'),(91,'문의사항있습니다91','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'ALERT'),(92,'문의사항있습니다92','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'ALERT'),(93,'문의사항있습니다93','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'ETC'),(94,'문의사항있습니다94','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'DUST'),(95,'문의사항있습니다95','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'DUST'),(96,'문의사항있습니다96','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',2,'ALERT'),(97,'문의사항있습니다97','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',3,'ETC'),(98,'문의사항있습니다98','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',4,'ETC'),(99,'문의사항있습니다99','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',5,'DUST'),(100,'문의사항있습니다100','문의사항입니다. 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구 어쩌구저쩌구',0,'2024-07-06 06:41:12',1,'ETC'),(101,'문의사항','안녕하세요. 다름이아니라 어쩌구 저쩌구',0,'2024-07-06 08:35:48',1,'DUST'),(102,'ㅁㅁ','ㅁㅁ',0,'2024-07-06 09:00:05',1,'ETC');
/*!40000 ALTER TABLE `question_board` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping events for database 'water2water'
--

--
-- Dumping routines for database 'water2water'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-07-06 18:04:56
